{"backend": "tensorflow", "class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Conv2D", "config": {"batch_input_shape": [null, 64, 64, 3], "data_format": "channels_last", "dtype": "float32", "activity_regularizer": null, "kernel_regularizer": null, "filters": 32, "kernel_size": [3, 3], "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "activation": "relu", "name": "conv2d_1", "strides": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_1", "trainable": true}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "trainable": true, "filters": 32, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "activation": "relu", "name": "conv2d_2", "strides": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_2", "trainable": true}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "units": 128, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "activation": "relu"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "units": 1, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "activation": "sigmoid"}}]}, "keras_version": "2.2.4"}